{
    "title":"Experiencia profesional",
    "descr":"Como desarrollador freelancer, he utilizado diferentes tecnologias que me permitieron potenciar mis capacidades en mis distintos entornos profesionales.\n Entre mis proyectos se destacan los siguientes.",
    "date":"2021 - presente",
    "tech":{
        "title":"Tecnologias:",
        "data":"python, javascript, ReactJs, NodeJs, MongoDB, SQLite"
    },
    "langs":[
        {
            "lang":"ReactJs",
            "projs":[
                "Trabaje como desarrollador en un equipo freelance para un e-commerce, diseñando y desarrollando una pagina web responsive (actualmente no disponible)",
                "He desarrollado un front-end responsive para un e-commerce ficticio como parte del trabajo final de mi curso de ReactJS."
            ]
        },
        {
            "lang":"Python",
            "projs":[
                "He desarrollado aplicaciones de escritorio para manipular y automatizar tareas de documentación en mi entorno laboral.",
                "He creado un servidor FLASK para guardar firmas de usuario para documentación.",
                "He desarrollado herramientas de escritorio para comunicacion con diferentes dispositivos a traves de protocolo UART con propositos de configuración",
                "Construcción de una aplicacion de escritorio para ejecutar programas definidos por usuarios en una maquina de descarga de baterias."
            ]
        },
        {
            "lang":"JavaScript",
            "projs":[
                "Desarrollo de una extensión para chrome que optimiza la firma de documentos y ayuda en la organización de los mismos."
            ]
        },
        {
            "lang":"Full-stack",
            "projs":[
                "Diseño y desarrollo de una plataforma Full-Stack para control de dispositivos IOT, incluyendo registro de usuarios y mensajeria MQTT - Desarrollado de manera independiente como proyecto autoiniciado, usando tecnologias como ReactJS (Frontend), NodeJS (Backend) y MongoDB (Base de datos)"
            ]
        },{
            "lang":"Nota",
            "projs":[
                {
                    "nota":"Este texto fue generado como parte de un proyecto personal de Backend, utilizando NodeJS para la gestion de archivos y handlebars como motor de plantillas para renderizado, link: ",
                    "link":"https://github.com/Ing-ed/Resume.git"
                }
            ]
        }
    ]
}